#pragma once
#include "Object.h"
#include"input.h"
#include"Sound.h"

#include"Word1_Stage.h"

//#define STAGE_X (32)//横のマス数
//#define STAGE_Y (18)//縦のマス数
//
////ブロックのサイズ
//#define BLOCKSIZE_X (40)
//#define BLOCKSIZE_Y (40)

enum WORLD_NUMBER
{
	WORLD1=1,
	WORLD2,
	WORLD3,
	WORLD4,
	WORLD5,
	WORLD6,
};




class Game
{
private:
	Input input;//キー入力オブジェクト
	Sound sound;
	Object player;//プレイヤーオブジェクト
	Object background; //背景オブジェクト
	Object scoreboard;//スコアオブジェクト
	Object title;//タイトルオブジェクト
	Object gametitle;//タイトル画面
	Object blocks[STAGE_X][STAGE_Y];//ブロックオブジェクト
	int data[STAGE_X][STAGE_Y + 3] = {};//データ配列
	int TetrominoType; //テトリミノの種類（０～６）
	int TetrominoDirection; //テトリミノの向き（０～３）
	int state = 0;//ゲームの状態（０：落下するものがない状態　１：落下中）
	int score = 0;//得点
	int scene = 0;//シーン（０：タイトル、１：ゲーム本編）
	int Exflg = 0;//０：揃ってない　１：揃ってる
	int check = 0;
	int limy;

	//HWND hWnd;
	//World1_Stage* stage;

	int TetrominoData[7][4][4][4] =
	{
		{//直線（Iミノ）
			{//0
				{0,0,0,0},
				{0,0,0,0},
				{2,2,2,2},
				{0,0,0,0},
			},
			{//1
				{0,0,2,0},
				{0,0,2,0},
				{0,0,2,0},
				{0,0,2,0},
			},
			{//2
				{0,0,0,0},
				{2,2,2,2},
				{0,0,0,0},
				{0,0,0,0},
			},
			{//1
				{0,2,0,0},
				{0,2,0,0},
				{0,2,0,0},
				{0,2,0,0},
			},
		},
		{//四角（Oミノ）
			{//0
				{0,0,0,0},
				{0,2,2,0},
				{0,2,2,0},
				{0,0,0,0},
			},
			{//1
				{0,0,0,0},
				{0,2,2,0},
				{0,2,2,0},
				{0,0,0,0},
			},
			{//2
				{0,0,0,0},
				{0,2,2,0},
				{0,2,2,0},
				{0,0,0,0},
			},
			{//1
				{0,0,0,0},
				{0,2,2,0},
				{0,2,2,0},
				{0,0,0,0},
			},
		},
		{//S字（Sミノ）
			{//0
				{0,0,0,0},
				{0,0,0,0},
				{2,2,0,0},
				{0,2,2,0},
			},
			{//1
				{0,0,0,0},
				{0,0,2,0},
				{0,2,2,0},
				{0,2,0,0},
			},
			{//2
				{0,0,0,0},
				{2,2,0,0},
				{0,2,2,0},
				{0,0,0,0},
			},
			{//1
				{0,0,0,0},
				{0,2,0,0},
				{2,2,0,0},
				{2,0,0,0},
			},
		},
		{//逆S字（Zミノ）
			{//0
				{0,0,0,0},
				{0,0,0,0},
				{0,2,2,0},
				{2,2,0,0},
			},
			{//1
				{0,0,0,0},
				{0,2,0,0},
				{0,2,2,0},
				{0,0,2,0},
			},
			{//2
				{0,0,0,0},
				{0,2,2,0},
				{2,2,0,0},
				{0,0,0,0},
			},
			{//1
				{0,0,0,0},
				{2,0,0,0},
				{2,2,0,0},
				{0,2,0,0},
			},
		},
		{//逆K字（Jミノ）
			{//0
				{0,0,0,0},
				{0,0,0,0},
				{2,2,2,0},
				{2,0,0,0},
			},
			{//1
				{0,0,0,0},
				{0,2,0,0},
				{0,2,0,0},
				{0,2,2,0},
			},
			{//2
				{0,0,0,0},
				{0,0,2,0},
				{2,2,2,0},
				{0,0,0,0},
			},
			{//1
				{0,0,0,0},
				{2,2,0,0},
				{0,2,0,0},
				{0,2,0,0},
			},
		},
		{//L字（Lミノ）
			{//0
				{0,0,0,0},
				{0,0,0,0},
				{2,2,2,0},
				{0,0,2,0},
			},
			{//1
				{0,0,0,0},
				{0,2,2,0},
				{0,2,0,0},
				{0,2,0,0},
			},
			{//2
				{0,0,0,0},
				{2,2,2,0},
				{2,0,0,0},
				{0,0,0,0},
			},
			{//1
				{0,0,0,0},
				{0,2,0,0},
				{0,2,0,0},
				{2,2,0,0},
			},
		},
		{//T字（Tミノ）
			{//0
				{0,0,0,0},
				{0,0,0,0},
				{2,2,2,0},
				{0,2,0,0},
			},
			{//1
				{0,0,0,0},
				{0,2,0,0},
				{0,2,2,0},
				{0,2,0,0},
			},
			{//2
				{0,0,0,0},
				{0,2,0,0},
				{2,2,2,0},
				{0,0,0,0},
			},
			{//1
				{0,0,0,0},
				{0,2,0,0},
				{2,2,0,0},
				{0,2,0,0},
			},
		},
	};

public:
	int count = 0;//自動落下のカウント

	Game();//コンストラクタ

	void Init(HWND hWnd); //初期化
	void Update(void);    //更新
	void Draw();          //描画 
	void Uninit();        //終了  

};

